notes.org
#+title: Course Notes
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="myStyle.css" />
#+OPTIONS: html-style:nil H:2 toc:2
#+HTML_LINK_HOME: index.html
This is very rough draft set of notes (more of a collection of
thoughts) for the course CAS CS 392 at Boston University.  It's
primarily a supplement to [[https://doc.rust-lang.org/stable/book/title-page.html][The Rust Programming Language (RPL)]].  It's
full of typos and dumb jokes.
* What is this course?
:PROPERTIES:
:CUSTOM_ID: intro
:END:
We usually learn PLs the "wrong" way: throw spaghetti code at the wall
and see what sticks.[fn::My nature does not allow me to introduce
anything without a wannabe-hybrid-Salinger-Wallace-esqe preamble.  I
wish it didn't have to be this way but at some point, we can't break
from our aesthetic inclinations.]  This course is an experiment in
learning a PL the "right" way: give an airtight specification of a PL
using the mathematical framework of PL theory.

Rust is an excellent testbed for this kind of experiment. It's a PL
that's gaining in popularity but has some bizzaro features in its type
systems[fn::An uncommon pairing, most popular languages are beige
wallpaper boring.] that turn out to be incredibly useful for
addressing some of the more egregious bugs in low-level programming.
Add to that the fact the theoretical underpinnings of Rust are
simultaneously very old (it's based on /linear logic/, an innovation
of Jean-Yves Girard from the 80s, based on ideas that came long before
it) and very young (the formalization of Rust-proper postdates its own
conception and popularity, as evidenced by the publication year (2021)
of the paper we'll use in the second half of the course). This gives
us a wide range of sources to better understand what the heck is going
on with this language.

The points is not to learn Rust, at least not entirely.[fn::I don't
even like Rust that much, to be honest.  It's probably most
fascinating to me from a social theoretical perspective than from a PL
design perspective.]  The point is to /understand the core of Rust/.
Per the previous paragraph, this means learning a bit of mathematics.
It also means dipping into research from /this decade/, which means
learning to read academic papers (more of a skill than you might
expect).  And since we're learning a PL, we might as well build
something with it.  The proverbial "they" say that you don't know a PL
until you've done a project in it.  The less-proverbial "they" might
say you don't know a PL until you understand it's formal
specification.  We'll kill two birds with one stone[fn::I had a
conversation with some folks about possible alternative idioms.  PETA
recommends "feed two birds with one scone." Not punchy enough in my
opinion.  My dad came up with two pretty good ones: "strike out to
batters with one pitch" (nonsensical in a pleasant way) and "destroy
two planets with one deathstar" (to better align with nerd culture).]
and build an interpreter in Rust for a subset of Rust.  So our rough
plan:

+ learn enough Rust to be dangerous
+ learn to read/practice reading research papers in PL, so that we can
  read a paper which gives a formal specification of a subset of Rust
  (we'll do this together as a group)
+ Test our knowledge by /implementing/ that subset of Rust /in Rust/

Now, admittedly, I'd like to believe that's all the motivation we'll
need.  If you're interested in this course, I'd hope you also have some
iota of preexisting interest in Rust.  But it is my duty to
(begrudgingly) motivate why you should learn something interesting.
+ *For those interested in PL:* Linear types, affine types, types for
  concurrency, these are /current/ research areas.  Rust is something
  of a success story, one of those rare instances of a PL becoming
  popular for being both interesting and usable.  If you took CS320,
  it's one thing to give a formal specification of a clean functional
  PL, applying these ideas to Rust and friends will be a formative
  challenge.
+ *For those interested in programming:* I am of the opinion that it's
  always valuable to learn a new language paradigm, but maybe that's
  not enough motivation──Rust is ranked 14th according to the
  [[https://www.tiobe.com/tiobe-index/][December 2024 TIOBE index]]
  with one of the most [[https://www.tiobe.com/tiobe-index/rust/][generally uptrending graphs]] in the top 20.
  It's being adopted by large companies like Amazon and Microsoft, but
  also smaller companies, anyone who needs safe low-level code.  Rust
  is an /ahead-of-time compiled/ language; it's good to have one of
  those in your back pocket, and I think Rust is one of the more
  interesting choices (over, say, C).
+ *For those interested in systems:* I can't pretend to really know
  what's going on in the world of systems, but Rust touts itself as
  having a lot of potential in this area.  It may be worthwhile to
  understand it, even if just to be able to adequately respond to the
  hype.
+ *Everyone else:* I dunno, good luck. If you're not one of the above,
  I honestly don't see any reason why you should learn Rust.

Enough preamble, let's Rust.
* Set Up
:PROPERTIES:
:CUSTOM_ID: set-up
:END:
Set up and installation of Rust is comparatively easy.  We'll
primarily be using *Cargo*, a build system for Rust akin to OCaml's Dune
(but quite a bit better).  You should follow the ~rustup~ [[https://doc.rust-lang.org/stable/book/ch01-01-installation.html][installation
instructions]] in RPL for your OS.

#+begin_quote
*Note:* If you're running Windows, then I'll assume that you're
using WSL.  You're welcome to try to install directly, but /I will not
help you troubleshoot./ Not so much because I don't want (also, I
don't) but because I don't really know how.
#+end_quote

If you'd like, you can go through the [[https://doc.rust-lang.org/stable/book/ch01-02-hello-world.html][Hello, World!]] section of RPL,
but we won't be using the rust compiler directly in this course.
Instead, we'll follow RPL's recommendations on project hygiene and
always assume a Cargo project.  You /should/ go through the [[https://doc.rust-lang.org/stable/book/ch01-03-hello-cargo.html][Hello,
Cargo!]] section of RPL (we'll also go over it in lecture).

** Cargo
Cargo is a build system for Rust.  As usual, you can use

#+begin_src bash
  cargo --help
#+end_src

To see a list of commands for Cargo.  The main one's we'll need:
+ ~cargo new project_name~: create a new Cargo project (and directory)
  called ~cargo_name~
+ ~cargo build:~ Compile the project
+ ~cargo run:~ Run the executable built by ~cargo build~ (rebuilds
  first if necessary)
+ ~cargo clean:~ Cleans up build files (usually not necessary, but a
  good first step when troubleshooting an error)

You should go through the [[https://doc.rust-lang.org/stable/book/ch01-03-hello-cargo.html][Hello, Cargo!]] section of RPL to practice
this process.
