notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-20 Mon 13:14 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Course Notes</title>
<meta name="author" content="Nathan  Mull" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="myStyle.css" />
</head>
<body>
<div id="org-div-home-and-up"><a href="index.html">↩</a></div><div id="content" class="content">
<h1 class="title">Course Notes</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#intro">1. What is this course?</a></li>
<li><a href="#set-up">2. Set Up</a>
<ul>
<li><a href="#org591c97d">2.1. Cargo</a></li>
</ul>
</li>
<li><a href="#orge779a7f">3. The Basics</a>
<ul>
<li><a href="#org4294f2a">3.1. Variables and Mutability</a></li>
<li><a href="#org8cae4bc">3.2. Constants</a></li>
<li><a href="#org5b4ad7f">3.3. Data Types</a></li>
<li><a href="#orgdd6d285">3.4. Functions</a></li>
<li><a href="#org6f83579">3.5. Statements and Expressions</a></li>
<li><a href="#orgc7ded78">3.6. Control Flow</a></li>
</ul>
</li>
<li><a href="#orgaf1cc2e">4. Ownership</a>
<ul>
<li><a href="#org6d965a4">4.1. Stack and Heap</a></li>
<li><a href="#org321f05d">4.2. References and Borrowing</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
This is very rough draft set of notes (more of a collection of
thoughts) for the course CAS CS 392 at Boston University.  It's
primarily a supplement to <a href="https://doc.rust-lang.org/stable/book/title-page.html">The Rust Programming Language (RPL)</a>.  It's
full of typos and dumb jokes.
</p>
<div id="outline-container-intro" class="outline-2">
<h2 id="intro"><span class="section-number-2">1.</span> What is this course?</h2>
<div class="outline-text-2" id="text-intro">
<p>
We usually learn PLs the "wrong" way: throw spaghetti code at the wall
and see what sticks.<sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>  This course is an experiment in
learning a PL the "right" way: give an airtight specification of a PL
using the mathematical framework of PL theory.
</p>

<p>
Rust is an excellent testbed for this kind of experiment. It's a PL
that's gaining in popularity but has some bizzaro features in its type
systems<sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup> that turn out to be incredibly useful for
addressing some of the more egregious bugs in low-level programming.
Add to that the fact the theoretical underpinnings of Rust are
simultaneously very old (it's based on <i>linear logic</i>, an innovation
of Jean-Yves Girard from the 80s, based on ideas that came long before
it) and very young (the formalization of Rust-proper postdates its own
conception and popularity, as evidenced by the publication year (2021)
of the paper we'll use in the second half of the course). This gives
us a wide range of sources to better understand what the heck is going
on with this language.
</p>

<p>
The points is not to learn Rust, at least not entirely.<sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>  The point is to <i>understand the core of Rust</i>.
Per the previous paragraph, this means learning a bit of mathematics.
It also means dipping into research from <i>this decade</i>, which means
learning to read academic papers (more of a skill than you might
expect).  And since we're learning a PL, we might as well build
something with it.  The proverbial "they" say that you don't know a PL
until you've done a project in it.  The less-proverbial "they" might
say you don't know a PL until you understand it's formal
specification.  We'll kill two birds with one stone<sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>
and build an interpreter in Rust for a subset of Rust.  So our rough
plan:
</p>

<ul class="org-ul">
<li>learn enough Rust to be dangerous</li>
<li>learn to read/practice reading research papers in PL, so that we can
read a paper which gives a formal specification of a subset of Rust
(we'll do this together as a group)</li>
<li>Test our knowledge by <i>implementing</i> that subset of Rust <i>in Rust</i></li>
</ul>

<p>
Now, admittedly, I'd like to believe that's all the motivation we'll
need.  If you're interested in this course, I'd hope you also have some
iota of preexisting interest in Rust.  But it is my duty to
(begrudgingly) motivate why you should learn something interesting.
</p>
<ul class="org-ul">
<li><b>For those interested in PL:</b> Linear types, affine types, types for
concurrency, these are <i>current</i> research areas.  Rust is something
of a success story, one of those rare instances of a PL becoming
popular for being both interesting and usable.  If you took CS320,
it's one thing to give a formal specification of a clean functional
PL, applying these ideas to Rust and friends will be a formative
challenge.</li>
<li><b>For those interested in programming:</b> I am of the opinion that it's
always valuable to learn a new language paradigm, but maybe that's
not enough motivation──Rust is ranked 14th according to the
<a href="https://www.tiobe.com/tiobe-index/">December 2024 TIOBE index</a>
with one of the most <a href="https://www.tiobe.com/tiobe-index/rust/">generally uptrending graphs</a> in the top 20.
It's being adopted by large companies like Amazon and Microsoft, but
also smaller companies, anyone who needs safe low-level code.  Rust
is an <i>ahead-of-time compiled</i> language; it's good to have one of
those in your back pocket, and I think Rust is one of the more
interesting choices (over, say, C).</li>
<li><b>For those interested in systems:</b> I can't pretend to really know
what's going on in the world of systems, but Rust touts itself as
having a lot of potential in this area.  It may be worthwhile to
understand it, even if just to be able to adequately respond to the
hype.</li>
<li><b>Everyone else:</b> I dunno, good luck. If you're not one of the above,
I honestly don't see any reason why you should learn Rust.</li>
</ul>

<p>
Enough preamble, let's Rust.
</p>
</div>
</div>
<div id="outline-container-set-up" class="outline-2">
<h2 id="set-up"><span class="section-number-2">2.</span> Set Up</h2>
<div class="outline-text-2" id="text-set-up">
<p>
Set up and installation of Rust is comparatively easy.  We'll
primarily be using <b>Cargo</b>, a build system for Rust akin to OCaml's Dune
(but quite a bit better).  You should follow the <code>rustup</code> <a href="https://doc.rust-lang.org/stable/book/ch01-01-installation.html">installation
instructions</a> in RPL for your OS.
</p>

<blockquote>
<p>
<b>Note:</b> If you're running Windows, then I'll assume that you're
using WSL.  You're welcome to try to install directly, but <i>I will not
help you troubleshoot.</i> Not so much because I don't want (also, I
don't) but because I don't really know how.
</p>
</blockquote>

<p>
If you'd like, you can go through the <a href="https://doc.rust-lang.org/stable/book/ch01-02-hello-world.html">Hello, World!</a> section of RPL,
but we won't be using the rust compiler directly in this course.
Instead, we'll follow RPL's recommendations on project hygiene and
always assume a Cargo project.  You <i>should</i> go through the <a href="https://doc.rust-lang.org/stable/book/ch01-03-hello-cargo.html">Hello,
Cargo!</a> section of RPL (we'll also go over it in lecture).
</p>
</div>

<div id="outline-container-org591c97d" class="outline-3">
<h3 id="org591c97d"><span class="section-number-3">2.1.</span> Cargo</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Cargo is a build system for Rust.  As usual, you can use
</p>

<div class="org-src-container">
<pre class="src src-bash">cargo --help
</pre>
</div>

<p>
To see a list of commands for Cargo.  The main one's we'll need:
</p>
<ul class="org-ul">
<li><code>cargo new project_name</code>: create a new Cargo project (and directory)
called <code>cargo_name</code></li>
<li><code>cargo build:</code> Compile the project</li>
<li><code>cargo run:</code> Run the executable built by <code>cargo build</code> (rebuilds
first if necessary)</li>
<li><code>cargo clean:</code> Cleans up build files (usually not necessary, but a
good first step when troubleshooting an error)</li>
</ul>

<p>
You should go through the <a href="https://doc.rust-lang.org/stable/book/ch01-03-hello-cargo.html">Hello, Cargo!</a> section of RPL to practice
this process.
</p>
</div>
</div>
</div>
