notes.org
* The Basics
This is a collection of concepts that are common to all PLs.  I expect
that you're already familiar with all of these concepts.  The goal
here is to provide a more careful analysis of these concepts,
primarily with respect to syntax.  Each section begins with a BNF
specification of the Rust syntax.  These specifications are
approximations, but for simple programs are sufficient.
** Variables and Mutability
#+begin_quote
*Grammar:*
#+begin_src bnf
  <var-decl>  ::= let <var-ident> = <expr>
                | let mut <var-ident> = <expr>
  <var-ident> ::= ; snake_case ;
#+end_src
#+end_quote

Variables are immutable by default.  This is generally safer
(mutability is the root of much evil).  If you attempt to mutate an
immutable variable, you'll get a compiler error.  You can reuse (i.e.,
shadow) variable names with declarations.

#+begin_quote
*Example:*
#+begin_src rust
  let x = 1;         // assign x to the value 1
  assert_eq!(x, 1);  // assert that x is equal to 1
                     // (also, note the comment syntax)
#+end_src
#+end_quote

We use the ~mut~ keyword to declare mutable variables, which are
allowed to be reassigned/mutated.

#+begin_quote
*Example:*
#+begin_src rust
  let mut x = 1;
  x = 2;
  assert_eq!(x, 2);
#+end_src
#+end_quote
** Constants
#+begin_quote
*Grammar:*
#+begin_src bnf
  <const-decl>  ::= const <const-ident> : <ty> = <expr>
  <const-ident> ::= ; SCREAMING_SNAKE_CASE ;
#+end_src
#+end_quote

Constants are like immutable variables except that:

+ they are declared with the ~const~ keyword
+ by convention, they are named using ~SCREAMING_SNAKE_CASE~
+ they must be type annotated
+ they must be assigned to values computed at compile-time (e.g., no
  stdin reads)

Constants are primarily useful for code clarity.

#+begin_quote
*Example:*
#+begin_src rust
  const SPEED_OF_LIGHT : u32 = 299792458;
  assert_eq!(SPEED_OF_LIGHT, 299792458);
#+end_src
#+end_quote
