notes.html
<div id="outline-container-orge779a7f" class="outline-2">
<h2 id="orge779a7f"><span class="section-number-2">3.</span> The Basics</h2>
<div class="outline-text-2" id="text-3">
<p>
This is a collection of concepts that are common to all PLs.  I expect
that you're already familiar with all of these concepts.  The goal
here is to provide a more careful analysis of these concepts,
primarily with respect to syntax.  Each section begins with a BNF
specification of the Rust syntax.  These specifications are
approximations, but for simple programs are sufficient.
</p>
</div>
<div id="outline-container-org4294f2a" class="outline-3">
<h3 id="org4294f2a"><span class="section-number-3">3.1.</span> Variables and Mutability</h3>
<div class="outline-text-3" id="text-3-1">
<blockquote>
<p>
<b>Grammar:</b>
</p>
<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">var-decl</span>&gt;  <span style="color: #008b8b;">::=</span> let &lt;<span style="color: #483d8b;">var-ident</span>&gt; = &lt;<span style="color: #483d8b;">expr</span>&gt;
              <span style="color: #ff0000; font-weight: bold;">|</span> let mut &lt;<span style="color: #483d8b;">var-ident</span>&gt; = &lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #0000ff;">var-ident</span>&gt; <span style="color: #008b8b;">::=</span> <span style="color: #b22222;">; snake_case ;</span>
</pre>
</div>
</blockquote>

<p>
Variables are immutable by default.  This is generally safer
(mutability is the root of much evil).  If you attempt to mutate an
immutable variable, you'll get a compiler error.  You can reuse (i.e.,
shadow) variable names with declarations.
</p>

<blockquote>
<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">let</span> <span style="color: #a0522d;">x</span> = 1;         <span style="color: #b22222;">// </span><span style="color: #b22222;">assign x to the value 1</span>
<span style="color: #483d8b;">assert_eq!</span>(x, 1);  <span style="color: #b22222;">// </span><span style="color: #b22222;">assert that x is equal to 1</span>
                   <span style="color: #b22222;">// </span><span style="color: #b22222;">(also, note the comment syntax)</span>
</pre>
</div>
</blockquote>

<p>
We use the <code>mut</code> keyword to declare mutable variables, which are
allowed to be reassigned/mutated.
</p>

<blockquote>
<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">let</span> <span style="color: #a020f0;">mut</span> <span style="color: #a0522d;">x</span> = 1;
x = 2;
<span style="color: #483d8b;">assert_eq!</span>(x, 2);
</pre>
</div>
</blockquote>
</div>
</div>
<div id="outline-container-org8cae4bc" class="outline-3">
<h3 id="org8cae4bc"><span class="section-number-3">3.2.</span> Constants</h3>
<div class="outline-text-3" id="text-3-2">
<blockquote>
<p>
<b>Grammar:</b>
</p>
<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">const-decl</span>&gt;  <span style="color: #008b8b;">::=</span> const &lt;<span style="color: #483d8b;">const-ident</span>&gt; : &lt;<span style="color: #483d8b;">ty</span>&gt; = &lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #0000ff;">const-ident</span>&gt; <span style="color: #008b8b;">::=</span> <span style="color: #b22222;">; SCREAMING_SNAKE_CASE ;</span>
</pre>
</div>
</blockquote>

<p>
Constants are like immutable variables except that:
</p>

<ul class="org-ul">
<li>they are declared with the <code>const</code> keyword</li>
<li>by convention, they are named using <code>SCREAMING_SNAKE_CASE</code></li>
<li>they must be type annotated</li>
<li>they must be assigned to values computed at compile-time (e.g., no
stdin reads)</li>
</ul>

<p>
Constants are primarily useful for code clarity.
</p>

<blockquote>
<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">const</span> <span style="color: #a0522d;">SPEED_OF_LIGHT</span> : <span style="color: #228b22;">u32</span> = 299792458;
<span style="color: #483d8b;">assert_eq!</span>(<span style="color: #228b22;">SPEED_OF_LIGHT</span>, 299792458);
</pre>
</div>
</blockquote>
</div>
</div>
