notes.org
** Data Types
#+begin_quote
*Grammar:*
#+begin_src bnf
  <ty>          ::= <scalar-ty> | <compound-ty>
  <scalar-ty>   ::= <int-ty> | <float-ty> | bool | char
  <int-ty>      ::= <sint-ty> | <uint-ty>
  <sint-ty>     ::= i16 | i32 | i64 | i128 | isize
  <uint-ty>     ::= u16 | u32 | u64 | u128 | usize
  <float-ty>    ::= f32 | f64
  <compound-ty> ::= <tuple-ty> | <array-ty>
  <tys>         ::= ϵ | <ty> | <ty> , <tys>
  <tuple-ty>    ::= ( <tys> )
  <array-ty>    ::= [<ty>；<expr>]

  <int-lit>     ::= ; see docs ;
  <float-lit>   ::= ; see docs ;
  <char-lit>    ::= ; see docs ;
  <bool-lit>    ::= true | false

  <exprs>       ::= ϵ | <expr> | <expr> , <exprs>
  <tuple-lit>   ::= ( <exprs> )
  <field>       ::= ; see docs ;
  <expr>        ::= <expr>.<field>

  <list-lit>    ::= [ <exprs> ]
  <expr>        ::= <expr>[<expr>]

  <lit>         ::= <int-lit> | <float-lit>
		 | <char-lit> | <bool-lit>
		 | <tuple-lit> | <string-lit>
#+end_src
#+end_quote

Rust is statically typed, i.e., the type of every variable is known at
compile-time.  Rust does some amount of type inference (except for
constant, it seems).  When in doubt, type annotate variables. It
doesn't hurt, and can act as a simple form of documentation.

There are two kinds of data types: *scalar* and *compound*.  Here's a
short outline, most of this should be familiar.

+ Scalar:
  + Integers:
    + ~i8~, ~i16~, ~i32~, ~i64~, ~i128~, and ~u8~, ~u16~, ~u32~, ~u64~, ~u128~
    + The number indicates the number of bits used to represent the
      integer. *The default for type inference is i32.*
    + There is also ~isize~ and ~usize~ used for indexing
    + There are standard literals for decimal, hex, octal, binary, and
      bytes.  Look them up if you need them.
    + Rust's compiler can check for integer overflow in debug mode, but
      wraps by default for release mode.  We're gonna ignore this for
      now (as if we'll be writing any production code...)
  + Floating-point numbers:
    + ~f32~ and ~f64~. *The default for type inference is ~f64~.*
    + Represented using IEEE-754 (of course)
  + Characters:
    + type: ~char~
    + example: ~'q'~, ~'✗'~
    + four bytes, represent unicode scalars (characters are weird but
      we won't dwell on this)
  + Booleans:
    + type: ~bool~
    + two literals: ~true~ and ~false~
+ Compound:
  + Tuples:
    + type: ~(t1, t2,..., tk)~
    + literal: ~(e1, e2,..., ek)~
    + accessor: ~p.i~
      #+begin_quote
      *Example:*
      #+begin_src rust
	let tup: (i32, bool, u32) = (2, true, 2);
	assert_eq!(tup.1, true);
      #+end_src
      #+end_quote
  + Arrays:
    + type: ~[t; n]~ where ~t~ is a type and ~n~ is a ~usize~ for the
      number of elements. *IMPORTANT: Arrays are fixed length.*
    + Arrays are allocated on the stack. Rust panics if an index is
      out of bounds (in particular, it /actually checks/ at runtime).
    + indexing: ~a[i]~, where ~i~ is a ~usize~.
      #+begin_quote
      *Example:*
      #+begin_src rust
	const J : usize = 5;
	let a : [u32; J] = [1, 2, 3, 4, 5];
	let i : usize = 2;
	assert_eq!(a[i], 3);
      #+end_src
      #+end_quote

Check the appendix in RPL on [[https://doc.rust-lang.org/stable/book/appendix-02-operators.html#operators][Operators]] for details on operators,
arithmetic, Boolean or otherwise.  We will, of course, see more types
as the course goes on (and define our own types).
