notes.html
<div id="outline-container-org5b4ad7f" class="outline-3">
<h3 id="org5b4ad7f"><span class="section-number-3">3.3.</span> Data Types</h3>
<div class="outline-text-3" id="text-3-3">
<blockquote>
<p>
<b>Grammar:</b>
</p>
<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">ty</span>&gt;          <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">scalar-ty</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">compound-ty</span>&gt;
&lt;<span style="color: #0000ff;">scalar-ty</span>&gt;   <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">int-ty</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">float-ty</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> bool <span style="color: #ff0000; font-weight: bold;">|</span> char
&lt;<span style="color: #0000ff;">int-ty</span>&gt;      <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">sint-ty</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">uint-ty</span>&gt;
&lt;<span style="color: #0000ff;">sint-ty</span>&gt;     <span style="color: #008b8b;">::=</span> i16 <span style="color: #ff0000; font-weight: bold;">|</span> i32 <span style="color: #ff0000; font-weight: bold;">|</span> i64 <span style="color: #ff0000; font-weight: bold;">|</span> i128 <span style="color: #ff0000; font-weight: bold;">|</span> isize
&lt;<span style="color: #0000ff;">uint-ty</span>&gt;     <span style="color: #008b8b;">::=</span> u16 <span style="color: #ff0000; font-weight: bold;">|</span> u32 <span style="color: #ff0000; font-weight: bold;">|</span> u64 <span style="color: #ff0000; font-weight: bold;">|</span> u128 <span style="color: #ff0000; font-weight: bold;">|</span> usize
&lt;<span style="color: #0000ff;">float-ty</span>&gt;    <span style="color: #008b8b;">::=</span> f32 <span style="color: #ff0000; font-weight: bold;">|</span> f64
&lt;<span style="color: #0000ff;">compound-ty</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">tuple-ty</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">array-ty</span>&gt;
&lt;<span style="color: #0000ff;">tys</span>&gt;         <span style="color: #008b8b;">::=</span> &#1013; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">ty</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">ty</span>&gt; , &lt;<span style="color: #483d8b;">tys</span>&gt;
&lt;<span style="color: #0000ff;">tuple-ty</span>&gt;    <span style="color: #008b8b;">::=</span> ( &lt;<span style="color: #483d8b;">tys</span>&gt; )
&lt;<span style="color: #0000ff;">array-ty</span>&gt;    <span style="color: #008b8b;">::=</span> [&lt;<span style="color: #483d8b;">ty</span>&gt;&#65307;&lt;<span style="color: #483d8b;">expr</span>&gt;]

&lt;<span style="color: #0000ff;">int-lit</span>&gt;     <span style="color: #008b8b;">::=</span> <span style="color: #b22222;">; see docs ;</span>
&lt;<span style="color: #0000ff;">float-lit</span>&gt;   <span style="color: #008b8b;">::=</span> <span style="color: #b22222;">; see docs ;</span>
&lt;<span style="color: #0000ff;">char-lit</span>&gt;    <span style="color: #008b8b;">::=</span> <span style="color: #b22222;">; see docs ;</span>
&lt;<span style="color: #0000ff;">bool-lit</span>&gt;    <span style="color: #008b8b;">::=</span> true <span style="color: #ff0000; font-weight: bold;">|</span> false

&lt;<span style="color: #0000ff;">exprs</span>&gt;      <span style="color: #008b8b;">::=</span> &#1013; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">expr</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">expr</span>&gt; , &lt;<span style="color: #483d8b;">exprs</span>&gt;
&lt;<span style="color: #0000ff;">tuple-lit</span>&gt;  <span style="color: #008b8b;">::=</span> ( &lt;<span style="color: #483d8b;">exprs</span>&gt; )
&lt;<span style="color: #0000ff;">field</span>&gt;      <span style="color: #008b8b;">::=</span> <span style="color: #b22222;">; see docs ;</span>
&lt;<span style="color: #0000ff;">expr</span>&gt;       <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">expr</span>&gt;.&lt;<span style="color: #483d8b;">field</span>&gt;

&lt;<span style="color: #0000ff;">list-lit</span>&gt;   <span style="color: #008b8b;">::=</span> [ &lt;<span style="color: #483d8b;">exprs</span>&gt; ]
&lt;<span style="color: #0000ff;">expr</span>&gt;       <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">expr</span>&gt;[&lt;<span style="color: #483d8b;">expr</span>&gt;]

&lt;<span style="color: #0000ff;">lit</span>&gt;        <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">int-lit</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">float-lit</span>&gt;
               <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">char-lit</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">bool-lit</span>&gt;
               <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">tuple-lit</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">string-lit</span>&gt;
</pre>
</div>
</blockquote>

<p>
Rust is statically typed, i.e., the type of every variable is known at
compile-time.  Rust does some amount of type inference (except for
constant, it seems).  When in doubt, type annotate variables. It
doesn't hurt, and can act as a simple form of documentation.
</p>

<p>
There are two kinds of data types: <b>scalar</b> and <b>compound</b>.  Here's a
short outline, most of this should be familiar.
</p>

<ul class="org-ul">
<li>Scalar:
<ul class="org-ul">
<li>Integers:
<ul class="org-ul">
<li><code>i8</code>, <code>i16</code>, <code>i32</code>, <code>i64</code>, <code>i128</code>, and <code>u8</code>, <code>u16</code>, <code>u32</code>, <code>u64</code>, <code>u128</code></li>
<li>The number indicates the number of bits used to represent the
integer. <b>The default for type inference is i32.</b></li>
<li>There is also <code>isize</code> and <code>usize</code> used for indexing</li>
<li>There are standard literals for decimal, hex, octal, binary, and
bytes.  Look them up if you need them.</li>
<li>Rust's compiler can check for integer overflow in debug mode, but
wraps by default for release mode.  We're gonna ignore this for
now (as if we'll be writing any production code&#x2026;)</li>
</ul></li>
<li>Floating-point numbers:
<ul class="org-ul">
<li><code>f32</code> and <code>f64</code>. <b>The default for type inference is <code>f64</code>.</b></li>
<li>Represented using IEEE-754 (of course)</li>
</ul></li>
<li>Characters:
<ul class="org-ul">
<li>type: <code>char</code></li>
<li>example: <code>'q'</code>, <code>'✗'</code></li>
<li>four bytes, represent unicode scalars (characters are weird but
we won't dwell on this)</li>
</ul></li>
<li>Booleans:
<ul class="org-ul">
<li>type: <code>bool</code></li>
<li>two literals: <code>true</code> and <code>false</code></li>
</ul></li>
</ul></li>
<li>Compound:
<ul class="org-ul">
<li>Tuples:
<ul class="org-ul">
<li>type: <code>(t1, t2,..., tk)</code></li>
<li>literal: <code>(e1, e2,..., ek)</code></li>
<li><p>
accessor: <code>p.i</code>
</p>
<blockquote>
<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">let</span> <span style="color: #a0522d;">tup</span>: (<span style="color: #228b22;">i32</span>, <span style="color: #228b22;">bool</span>, <span style="color: #228b22;">u32</span>) = (2, <span style="color: #a020f0;">true</span>, 2);
<span style="color: #483d8b;">assert_eq!</span>(tup.1, <span style="color: #a020f0;">true</span>);
</pre>
</div>
</blockquote></li>
</ul></li>
<li>Arrays:
<ul class="org-ul">
<li>type: <code>[t; n]</code> where <code>t</code> is a type and <code>n</code> is a <code>usize</code> for the
number of elements. <b>IMPORTANT: Arrays are fixed length.</b></li>
<li>Arrays are allocated on the stack. Rust panics if an index is
out of bounds (in particular, it <i>actually checks</i> at runtime).</li>
<li><p>
indexing: <code>a[i]</code>, where <code>i</code> is a <code>usize</code>.
</p>
<blockquote>
<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">const</span> <span style="color: #a0522d;">J</span> : <span style="color: #228b22;">usize</span> = 5;
<span style="color: #a020f0;">let</span> <span style="color: #a0522d;">a</span> : [<span style="color: #228b22;">u32</span>; <span style="color: #228b22;">J</span>] = [1, 2, 3, 4, 5];
<span style="color: #a020f0;">let</span> <span style="color: #a0522d;">i</span> : <span style="color: #228b22;">usize</span> = 2;
<span style="color: #483d8b;">assert_eq!</span>(a[i], 3);
</pre>
</div>
</blockquote></li>
</ul></li>
</ul></li>
</ul>

<p>
Check the appendix in RPL on <a href="https://doc.rust-lang.org/stable/book/appendix-02-operators.html#operators">Operators</a> for details on operators,
arithmetic, Boolean or otherwise.  We will, of course, see more types
as the course goes on (and define our own types).
</p>
</div>
</div>
