notes.org
** Functions
#+begin_quote
*Grammar:*
#+begin_src bnf
  <fun-decl>  ::= fn <fun-ident>(<params>) <block>
		| fn <fun-ident>(<params>) -> <ty> <block>
  <params>    ::= ϵ | <param> | <param> , <params>
  <param>     ::= <var-ident> : <ty>
  <block>     ::= { <stmts> }
  <fun-ident> ::= ; snake_case ;
#+end_src
#+end_quote

Functions in Rust behave much like functions in other PLs.  A couple
key notes:
+ parameters must be type-annotated
+ the return type must be given if the function returns a value

There is a ~return~ keyword, but we don't often use it; the return
value is the last expression in the function block. If no last
expression is given then the return value is ~()~ of type ~()~ (i.e.,
the unit type); see the ~<block>~ case in the given grammar for more
details about how the bodies of functions might look (there's a bit of
trickiness with regards to semicolons but I'm not going to dwell on it
since the compiler is pretty good at catching these things).

#+begin_quote
*Example:*
#+begin_src rust
fn sum_of_squares(x : u32, y : u32) -> u32 {
    let x_squared = x * x;
    let y_squared = y * y;
    x_squared + y_squared // NO SEMICOLON
}
#+end_src
#+end_quote
** Statements and Expressions
#+begin_quote
*Grammar:*
#+begin_src bnf
  <stmts>      ::= ϵ
		 | <expr>
		 | <fun-decl> <stmts>
		 | <stmt> ；<stmts>
		 | <expr> ；<stmts>
		 | <expr-no-sc> <stmts>
  <stmt>       ::= <var-decl> | <const-decl>
  <expr-no-sc> ::= <if-expr> | <while-expr> | <for-expr>
  <expr>       ::= <block>
		 | <lit>
		 | <uop-expr>
		 | <bop-expr>
		 | <call-expr>
		 | ( <expr> )
  <uop-expr>   ::= <uop> <expr>
  <bop-expr>   ::= <expr> <bop> <expr>
  <uop>        ::= ; see docs ;
  <bop>        ::= ; see docs ;
  <call-expr>  ::= <fn-ident>(<exprs>);
#+end_src
#+end_quote

Statements perform actions and do not have a value.  Expressions have
values (and are evaluated).  The only statements we've seen so far are
declarations.  Any expression can be assigned to a variable (you
should check this, it works even for things like ~while~ expressions).
** Control Flow
#+begin_quote
*Grammar:*
#+begin_src bnf
  <if-expr>      ::= if <expr> <block> <else-if-expr>
  <else-if-expr> ::= ϵ | else <block> | else if <block> <else-if-expr>
  <while-expr>   ::= while <expr> <block>
  <for-expr>     ::= for <var-ident> in <expr> <block>
  <ret-expr>     ::= return <expr>
  <expr>         ::= <if-expr> | <while-expr> | <for-expr> | <ret-expr>
#+end_src
#+end_quote

Control flow is also pretty standard. A couple things to keep in mind:
+ control flow is defined by /expressions/. This means they can be
  used as the values of variables; this is particularly nice for
  if-expressions
+ the then-case and the else-case blocks must be the same type

#+begin_quote
*Example.*

#+begin_src rust
fn is_prime(n: i32) -> bool {
    for i in 2..n {
	if n % i == 0 {
	    return false
	}
    }
    true
}
#+end_src
#+end_quote
* Ownership
Ownership accounts for the first plateau in the learning curve of
Rust.  In rough terms, /variables own their values/.  This means
values aren't necessarily copied on reassignment.  In Rust we're able
to /specify/ whether something is copied on reassignments (using a
mechanism called /traits/, similar to interfaces or type classes).

Ownership is necessitated in part by the way that Rust (and many
low-level PLs) manages memory.  We have to spend some time learning
about this memory management model in order to motivate the way Rust
is designed.
