notes.html
<div id="outline-container-orgdd6d285" class="outline-3">
<h3 id="orgdd6d285"><span class="section-number-3">3.4.</span> Functions</h3>
<div class="outline-text-3" id="text-3-4">
<blockquote>
<p>
<b>Grammar:</b>
</p>
<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">fun-decl</span>&gt;  <span style="color: #008b8b;">::=</span> fn &lt;<span style="color: #483d8b;">fun-ident</span>&gt;(&lt;<span style="color: #483d8b;">params</span>&gt;) &lt;<span style="color: #483d8b;">block</span>&gt;
              <span style="color: #ff0000; font-weight: bold;">|</span> fn &lt;<span style="color: #483d8b;">fun-ident</span>&gt;(&lt;<span style="color: #483d8b;">params</span>&gt;) -&gt; &lt;<span style="color: #483d8b;">ty</span>&gt; &lt;<span style="color: #483d8b;">block</span>&gt;
&lt;<span style="color: #0000ff;">params</span>&gt;    <span style="color: #008b8b;">::=</span> &#1013; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">param</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">param</span>&gt; , &lt;<span style="color: #483d8b;">params</span>&gt;
&lt;<span style="color: #0000ff;">param</span>&gt;     <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">var-ident</span>&gt; : &lt;<span style="color: #483d8b;">ty</span>&gt;
&lt;<span style="color: #0000ff;">block</span>&gt;     <span style="color: #008b8b;">::=</span> { &lt;<span style="color: #483d8b;">stmts</span>&gt; }
&lt;<span style="color: #0000ff;">fun-ident</span>&gt; <span style="color: #008b8b;">::=</span> <span style="color: #b22222;">; snake_case ;</span>
</pre>
</div>
</blockquote>

<p>
Functions in Rust behave much like functions in other PLs.  A couple
key notes:
</p>
<ul class="org-ul">
<li>parameters must be type-annotated</li>
<li>the return type must be given if the function returns a value</li>
</ul>

<p>
There is a <code>return</code> keyword, but we don't often use it; the return
value is the last expression in the function block. If no last
expression is given then the return value is <code>()</code> of type <code>()</code> (i.e.,
the unit type); see the <code>&lt;block&gt;</code> case in the given grammar for more
details about how the bodies of functions might look (there's a bit of
trickiness with regards to semicolons but I'm not going to dwell on it
since the compiler is pretty good at catching these things).
</p>

<blockquote>
<p>
<b>Example:</b>
</p>
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">sum_of_squares</span>(<span style="color: #a0522d;">x</span> : <span style="color: #228b22;">u32</span>, <span style="color: #a0522d;">y</span> : <span style="color: #228b22;">u32</span>) -&gt; <span style="color: #228b22;">u32</span> {
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">x_squared</span> = x * x;
    <span style="color: #a020f0;">let</span> <span style="color: #a0522d;">y_squared</span> = y * y;
    x_squared + y_squared <span style="color: #b22222;">// </span><span style="color: #b22222;">NO SEMICOLON</span>
}
</pre>
</div>
</blockquote>
</div>
</div>
<div id="outline-container-org6f83579" class="outline-3">
<h3 id="org6f83579"><span class="section-number-3">3.5.</span> Statements and Expressions</h3>
<div class="outline-text-3" id="text-3-5">
<blockquote>
<p>
<b>Grammar:</b>
</p>
<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">stmts</span>&gt;      <span style="color: #008b8b;">::=</span> &#1013;
               <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">expr</span>&gt;
               <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">fun-decl</span>&gt; &lt;<span style="color: #483d8b;">stmts</span>&gt;
               <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">stmt</span>&gt; &#65307;&lt;<span style="color: #483d8b;">stmts</span>&gt;
               <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">expr</span>&gt; &#65307;&lt;<span style="color: #483d8b;">stmts</span>&gt;
               <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">expr-no-sc</span>&gt; &lt;<span style="color: #483d8b;">stmts</span>&gt;
&lt;<span style="color: #0000ff;">stmt</span>&gt;       <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">var-decl</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">const-decl</span>&gt;
&lt;<span style="color: #0000ff;">expr-no-sc</span>&gt; <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">if-expr</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">while-expr</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">for-expr</span>&gt;
&lt;<span style="color: #0000ff;">expr</span>&gt;       <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">block</span>&gt;
               <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">lit</span>&gt;
               <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">uop-expr</span>&gt;
               <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">bop-expr</span>&gt;
               <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">call-expr</span>&gt;
               <span style="color: #ff0000; font-weight: bold;">|</span> ( &lt;<span style="color: #483d8b;">expr</span>&gt; )
&lt;<span style="color: #0000ff;">uop-expr</span>&gt;   <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">uop</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #0000ff;">bop-expr</span>&gt;   <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">expr</span>&gt; &lt;<span style="color: #483d8b;">bop</span>&gt; &lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #0000ff;">uop</span>&gt;        <span style="color: #008b8b;">::=</span> <span style="color: #b22222;">; see docs ;</span>
&lt;<span style="color: #0000ff;">bop</span>&gt;        <span style="color: #008b8b;">::=</span> <span style="color: #b22222;">; see docs ;</span>
&lt;<span style="color: #0000ff;">call-expr</span>&gt;  <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">fn-ident</span>&gt;(&lt;<span style="color: #483d8b;">exprs</span>&gt;)<span style="color: #b22222;">;</span>
</pre>
</div>
</blockquote>

<p>
Statements perform actions and do not have a value.  Expressions have
values (and are evaluated).  The only statements we've seen so far are
declarations.  Any expression can be assigned to a variable (you
should check this, it works even for things like <code>while</code> expressions).
</p>
</div>
</div>
<div id="outline-container-orgc7ded78" class="outline-3">
<h3 id="orgc7ded78"><span class="section-number-3">3.6.</span> Control Flow</h3>
<div class="outline-text-3" id="text-3-6">
<blockquote>
<p>
<b>Grammar:</b>
</p>
<div class="org-src-container">
<pre class="src src-bnf">&lt;<span style="color: #0000ff;">if-expr</span>&gt;      <span style="color: #008b8b;">::=</span> if &lt;<span style="color: #483d8b;">expr</span>&gt; { &lt;<span style="color: #483d8b;">stmts</span>&gt; } &lt;<span style="color: #483d8b;">else-if-expr</span>&gt;
&lt;<span style="color: #0000ff;">else-if-expr</span>&gt; <span style="color: #008b8b;">::=</span> &#1013; <span style="color: #ff0000; font-weight: bold;">|</span> else { &lt;<span style="color: #483d8b;">stmts</span>&gt; } <span style="color: #ff0000; font-weight: bold;">|</span> else if { &lt;<span style="color: #483d8b;">stmts</span>&gt; } &lt;<span style="color: #483d8b;">else-if-expr</span>&gt;
&lt;<span style="color: #0000ff;">while-expr</span>&gt;   <span style="color: #008b8b;">::=</span> while &lt;<span style="color: #483d8b;">expr</span>&gt; { &lt;<span style="color: #483d8b;">stmts</span>&gt; }
&lt;<span style="color: #0000ff;">for-expr</span>&gt;     <span style="color: #008b8b;">::=</span> for &lt;<span style="color: #483d8b;">var-ident</span>&gt; in &lt;<span style="color: #483d8b;">expr</span>&gt; { &lt;<span style="color: #483d8b;">stmts</span>&gt; }
&lt;<span style="color: #0000ff;">ret-expr</span>&gt;     <span style="color: #008b8b;">::=</span> return &lt;<span style="color: #483d8b;">expr</span>&gt;
&lt;<span style="color: #0000ff;">expr</span>&gt;         <span style="color: #008b8b;">::=</span> &lt;<span style="color: #483d8b;">if-expr</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">while-expr</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">for-expr</span>&gt; <span style="color: #ff0000; font-weight: bold;">|</span> &lt;<span style="color: #483d8b;">ret-expr</span>&gt;
</pre>
</div>
</blockquote>

<p>
Control flow is also pretty standard. A couple things to keep in mind:
</p>
<ul class="org-ul">
<li>control flow is defined by <i>expressions</i>. This means they can be
used as the values of variables; this is particularly nice for
if-expressions</li>
<li>the then-case and the else-case blocks must be the same type</li>
</ul>

<blockquote>
<p>
<b>Example.</b>
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #a020f0;">fn</span> <span style="color: #0000ff;">is_prime</span>(<span style="color: #a0522d;">n</span>: <span style="color: #228b22;">i32</span>) -&gt; <span style="color: #228b22;">bool</span> {
    <span style="color: #a020f0;">for</span> <span style="color: #a0522d;">i</span> <span style="color: #a020f0;">in</span> 2..n {
        <span style="color: #a020f0;">if</span> n % i == 0 {
            <span style="color: #a020f0;">return</span> <span style="color: #a020f0;">false</span>
        }
    }
    <span style="color: #a020f0;">true</span>
}
</pre>
</div>
</blockquote>
</div>
</div>
</div>
<div id="outline-container-orgaf1cc2e" class="outline-2">
<h2 id="orgaf1cc2e"><span class="section-number-2">4.</span> Ownership</h2>
<div class="outline-text-2" id="text-4">
<p>
Ownership accounts for the first plateau in the learning curve of
Rust.  In rough terms, <i>variables own their values</i>.  This means
values aren't necessarily copied on reassignment.  In Rust we're able
to <i>specify</i> whether something is copied on reassignments (using a
mechanism called <i>traits</i>, similar to interfaces or type classes).
</p>

<p>
Ownership is necessitated in part by the way that Rust (and many
low-level PLs) manages memory.  We have to spend some time learning
about this memory management model in order to motivate the way Rust
is designed.
</p>
</div>
